In [2]:
import numpy as np
import pandas as pd
arr = np.random.randint(100,1999, size= (3,5))
arr

array([[1030, 1306,  496, 1730, 1827],
       [1982, 1707,  518, 1833,  723],
       [1702, 1236,  849, 1447, 1107]])

In [9]:
# Each one D array is having 5 columns
df = pd.DataFrame(arr)
df

      0     1    2     3     4
0  1030  1306  496  1730  1827
1  1982  1707  518  1833   723
2  1702  1236  849  1447  1107

In [6]:
print(arr.shape[0])
print(arr.shape[1])

3
5

In [8]:
df.columns = ["col"+"-"+str(i) for i in range(len(df.keys()))]
df.columns

Index(['col-0', 'col-1', 'col-2', 'col-3', 'col-4'], dtype='object')

In [12]:
df = pd.DataFrame(arr, columns = ["col"+"-"+str(i) for i in range(len(df.keys()))]
)
df

   col-0  col-1  col-2  col-3  col-4
0   1030   1306    496   1730   1827
1   1982   1707    518   1833    723
2   1702   1236    849   1447   1107

In [13]:
index = ["row"+"-"+str(i) for i in range(len(df.keys()))]
index

['row-0', 'row-1', 'row-2', 'row-3', 'row-4']

In [18]:
pd.DataFrame(arr,index = ["row"+"-"+str(i) for i in range(len(df.keys()))],columns = ["col"+"-"+str(i) for i in range(len(df.values()))])

TypeError: 'numpy.ndarray' object is not callable

In [19]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['col-0', 'col-1', 'col-2', 'col-3', 'col-4'], dtype='object')]

In [24]:
# Statistical information
df.describe().T

       count         mean         std     min     25%     50%     75%     max
col-0    3.0  1571.333333  489.266117  1030.0  1366.0  1702.0  1842.0  1982.0
col-1    3.0  1416.333333  254.146283  1236.0  1271.0  1306.0  1506.5  1707.0
col-2    3.0   621.000000  197.759956   496.0   507.0   518.0   683.5   849.0
col-3    3.0  1670.000000  199.872459  1447.0  1588.5  1730.0  1781.5  1833.0
col-4    3.0  1219.000000  560.456956   723.0   915.0  1107.0  1467.0  1827.0

In [25]:
# Information about dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col-0   3 non-null      int32
 1   col-1   3 non-null      int32
 2   col-2   3 non-null      int32
 3   col-3   3 non-null      int32
 4   col-4   3 non-null      int32
dtypes: int32(5)
memory usage: 192.0 bytes

In [ ]:
# Absolute path entire path should be given including Cdrive
# Relative path is taking notebook and filename
# to_csv to_excel for exporting
# from files to notebook'
# read_csv read_csv

In [26]:
import os 
os.getcwd()

'C:\\Users\\lenovo\\INNOMATICS\\ Pandas Module'

In [33]:
df = pd.read_excel("pandas datasets/employees.xlsx")
df

    ID           Name   Department
0  101       John Doe           HR
1  102     Jane Smith  Engineering
2  103    Emily Davis        Sales
3  104  Michael Brown    Marketing

In [38]:
df

SyntaxError: invalid syntax (1395779291.py, line 1)

In [43]:
# When we give include object for categorical data
# top is for most repeating
df.describe(include = "object")employees.xlsx

            Name Department
count          4          4
unique         4          4
top     John Doe         HR
freq           1          1

In [46]:
iris = pd.read_csv("pandas datasets/Iris.csv")

In [47]:
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [50]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [49]:
iris.describe(include = "object")

            Species
count           150
unique            3
top     Iris-setosa
freq             50

In [51]:
iris["SepalLengthCm"].mean()

5.843333333333334

In [54]:
iris["SepalLengthCm"].std()

0.8280661279778629

In [56]:
iris["SepalWidthCm"].std()

0.4335943113621737

In [57]:
iris["Species"].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [58]:
iris["Species"].nunique()

3